# IFCLink Position Enumeration

Source: https://www.revitapidocs.com/2026/e07b870e-a4f5-082b-e8e7-907ff6b87556.htm

---

| IFCLink Position Enumeration |
| --- |

IFC Link Position within the Host Document.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum IFCLinkPosition
```

```
Public Enumeration IFCLinkPosition
```

```
public enum class IFCLinkPosition
```

```
type IFCLinkPosition
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| InternalOrigin | 0 | Link IFC Origin to Revit Internal Origin. |
| ProjectBasePoint | 1 | Link IFC Origin to Project Base Point. |
| SurveyPoint | 2 | Link IFC Origin to Survey Point. |

See Also

#### Reference

Autodesk.Revit.DB.IFC Namespace